{
  "company": "Lululemon",
  "job_description": "Guest Experience Lead | Crossgates Mall\nBack\nApply\nShare\nFacebook\nX\nEmail\nLocation:\nUnited States of America\nState/Province/City:\nNew York\nCity:\nAlbany\nBusiness Unit:\nStore\nTime Type:\nFull-time\nBack\nApply\nShare\nFacebook\nX\nEmail\nDescription & Requirements\nWho We Are\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth-focused environment for our people.\nJob Summary\nThe Guest Experience Lead is responsible for ensuring all guests (i.e., customers) receive a quality in-store experience. They do this by overseeing or providing technical product education that articulates the value of our product and brand to meet the unique needs of each guest. The Guest Experience Lead is part of the store leadership team, responsible for driving store performance on the floor through guest experience and team achievement of daily sales or unit targets. Guest Experience Leads provide input to team member performance evaluations, recommendations into store hiring decisions, and act as Supervisor on Duty (SOD) when leading the floor.\nCore Responsibilities of the Job\nBring the lululemon guest experience framework to life, leading from the floor to establish an exceptional and inclusive guest experience.\nContinuously assess the level of guest connection and technical product education, ensuring every single guest receives technical product education and assisting the guests when needed (e.g., when other team members are unavailable).\nMove dynamically and lead from the floor as the Supervisor on Duty to assess and fulfill the needs of the business, team, and guests.\nConduct preparation activities to ensure in-store readiness for guests and ensure the operational excellence of the store is maintained throughout shift.\nOpen and close the store in accordance with the opening and closing procedures.\nReview and interpret daily business data and metrics to track progress toward sales goals and motivate team to drive business results.\nParticipate in the store’s hiring process, including recruitment, selection and hiring recommendations, onboarding, and training.\nAddress team member performance and support their ongoing learning and development by providing direct feedback and in-the-moment recognition, coaching, demonstrations, and hands-on experiences.\nContribute to a respectful and inclusive team by establishing supportive working relationships and engaging with team members, creating a fun and productive environment.\nJob Requirements\nEligibility\nMust be legally authorized to work in the country in which the store is located\nMust have the ability to travel to assigned store with reliable transportation methods\nSchedule/Availability\nThe work schedule can vary based on store needs\nShifts are typically scheduled: mornings, afternoons, evenings, weekends, and holidays\nIn addition, during peak timeframes, special events, or other circumstances, the schedule may include early mornings or late nights/overnights for some team members\nExperience\n1 year retail or customer experience (e.g., guest resolution, navigating difficult conversations)\nSome experience in leading, mentoring, or delegating with others\nJob Assets (i.e., nice to have; not required)\nEducation: High school diploma/GED/equivalent, or above\nExperience: 1 year of retail/sales leadership experience (supervisor or people management not necessary; examples: leading delegated assignments/tasks, mentoring or assisting peers)\nFor Experiential stores with food/beverage service only:\nFood safety and/or liquor service certification\nWhat We Look For\nInclusion & Diversity:\nCreates/supports an inclusive environment that values/celebrates differences\nIntegrity:\nBehaves in an honest, fair, and ethical manner\nGuest Experience:\nActively creates an inclusive, high-caliber experience and connection for every guest through team members\nLeadership:\nIs able and desires to lead and inspire others; motivates, empowers, develops, and directs people as they work\nCollaboration and Teamwork:\nWorks productively with and supports others to achieve common goals; seeks connections, partnerships, and diverse perspectives\nDecision Making/Problem Solving:\nUses logic and reasoning to evaluate alternatives and make effective, timely decisions\nAdaptability/Agility:\nNavigates uncertainty and ambiguity and can change priorities in a fast-paced environment; recovers quickly from setbacks\nInteractive Communication:\nConveys information effectively and understands information shared while interacting with others\nWork Context (e.g., environment, interactions, physical)\nWork involves moving through the store with bright lights and loud music\nWork is accomplished as part of a team, sometimes independently, and sometimes on a computer or other technical devices\nWork may occasionally involve moving boxes weighing up to 30 lbs (13.6 kg)\nFor Experiential stores with food/beverage service only:\nWork may involve using industrial kitchen equipment and exposure to heat in order to prepare food or beverages\nCompensation & Benefits Package\nBase Pay Range\n: $22.50 - $25.89/hour, subject to minimum wage in the location\nTarget Bonus:\n$2.00/hour\nTotal Target Base Pay Range\n: $24.50 - $27.89/hour\nlululemon’s compensation offerings are grounded in a pay-for-performance philosophy that recognizes exceptional individual and team performance. The base pay offered is based on market location and may vary depending on job-related knowledge, skills, experience, and internal equity. As part of our offerings, employees in this position are eligible for our competitive bonus program, subject to program eligibility requirements.\nAt lululemon, investing in our people is a top priority. We believe that when life works, work works. We strive to be the place where inclusive leaders come to develop and enable all to be well. Recognizing our teams for their performance and dedication, other components of our total rewards offerings include support of career development, wellbeing, and personal growth:\nExtended health and dental benefits, and mental health plans\nPaid time off\nSavings and retirement plan matching\nGenerous employee discount\nFitness & yoga classes\nParenthood top-up\nExtensive catalog of development course offerings\nPeople networks, mentorship programs, and leadership series (to name a few)\nNote: The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.\nApply Now\nOnly those applicants under consideration will be contacted. Please accept our utmost appreciation for your interest. Lululemon is an Equal Employment Opportunity employer. Employment decisions are based on merit and business needs, and not on race, color, creed, age, sex, gender, sexual orientation, national origin, religion, marital status, medical condition, physical or mental disability, military service, pregnancy, childbirth and related medical conditions or any other classification protected by federal, state or provincial and local laws and ordinances. Reasonable accommodation is available for qualified individuals with disabilities, upon request. This Equal Employment Opportunity policy applies to all practices relating to recruitment and hiring, compensation, benefits, discipline, transfer, termination and all other terms and conditions of employment. While management is primarily responsible for seeing that Lululemon equal employment opportunity policies are implemented, you share in the responsibility for assuring that, by your personal actions, the policies are effective.\nlululemon is committed to providing reasonable accommodation to applicants with disabilities. If you would like someone from our team to contact you for individualized support, email us at\naccommodations@lululemon.com\n. In your email, please include the position title, the location of the position and the nature of your request.\nReady to join us?\nStart Your Career Search",
  "features": [
    "Product Knowledge (Lululemon)",
    "Sales Data Analysis",
    "Store Operations",
    "Retail Experience",
    "POS Systems",
    "Customer Connection",
    "Leadership",
    "Adaptability",
    "Communication",
    "Teamwork"
  ],
  "weights": [
    1.0,
    0.7,
    0.7,
    0.6,
    0.4,
    1.0,
    0.9,
    0.8,
    0.8,
    0.7
  ],
  "types": [
    "technical",
    "technical",
    "technical",
    "technical",
    "technical",
    "behavioral",
    "behavioral",
    "behavioral",
    "behavioral",
    "behavioral"
  ],
  "url": "https://careers.lululemon.com/en_US/careers/JobDetail/Guest-Experience-Lead-Crossgates-Mall/55003",
  "weights_dict": {
    "Product Knowledge (Lululemon)": 1.0,
    "Sales Data Analysis": 0.7,
    "Store Operations": 0.7,
    "Retail Experience": 0.6,
    "POS Systems": 0.4,
    "Customer Connection": 1.0,
    "Leadership": 0.9,
    "Adaptability": 0.8,
    "Communication": 0.8,
    "Teamwork": 0.7
  }
}